mdhardenburgh/Blinky/Packages/.cache/Keil.LPC800_DFP.1.10.1.pdsc
              __errorcontrol = 1;                                              // ignore errors
              Write32(AIRCR_Addr, 0x05FA0001);                                 // Execute VECTRESET via AIRCR
              __errorcontrol = 0;                                              // check errors
            </block>

            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) == 0" timeout="100000"/>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>

          <sequence name="ResetHardware"  info="HW RESET">
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;

              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);     // Deassert nRESET line
            </block>

            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000"/>

            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            </control>

            <control if="!canReadPins">
              <block>
                DAP_SWJ_Pins(nReset, nReset, 0);                               // Assert nRESET line
              </block>

              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000"/>
            </control>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>
<!-- Reset Stuff -->

<!-- Stop After Bootloader -->
          <sequence name="ResetCatchSet">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;
              __var FPB_BKPT_H = 0x80000000;
              __var FPB_BKPT_L = 0x40000000;
              __var FPB_COMP_M = 0x1FFFFFFC;
              __var FPB_KEY    = 0x00000002;
              __var FPB_ENABLE = 0x00000001;
            </block>

            <!-- read reset vector from Flash -->
            <block>
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR
            </block>

            <!-- set BreakPoint regardless whether reset vector is valid or not -->
            <block>
              Write32(0x40048000, 0x00000002);                                 // Map Flash to Vectors
              value = Read32 (0x00000004);                                     // Read Reset Vector

              value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
              Write32(0xE0002008, value);                                      // Set BP0 to Reset Vector
              Write32(0xE0002000, (FPB_KEY | FPB_ENABLE));                     // Enable FPB
            </block>

            <block>
              Read32(DHCSR_Addr);                                              // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            </block>
          </sequence>

          <sequence name="ResetCatchClear">
            <block>
              __var SCS_Addr   = 0xE000E000;
              __var DEMCR_Addr = SCS_Addr + 0xDFC;
              __var value      = 0;

              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR

              Write32(0xE0002008, 0x00000000);                                 // Clear BP0
              Write32(0xE0002000, 0x00000002);                                 // Disable FPB
            </block>
          </sequence>
<!-- Stop After Bootloader -->
        </sequences>

        <feature type="USART"         n="2"/>
        <feature type="I2C"           n="2"/>
        <feature type="SPI"           n="1"/>
        <feature type="ADC"           n="1"       m="12"  name="ADC"/>
        <feature type="DAC"           n="1"       m="10"  name="DAC"/>
        <feature type="WDT"           n="1"               name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="4"               name="One 32-bit general purpose, two channel Multi-Rate, Self-Wake-up"/>
        <feature type="AnalogOther"   n="1"               name="Comparator"/>
        <feature type="CoreOther"     n="1"               name="Capacitive Touch Interface"/>
        <feature type="CoreOther"     n="1"               name="CRC engine"/>
        <feature type="CoreOther"     n="1"               name="Unique device serial number"/>

        <!-- *************************  Device 'LPC804M101JDH20'  ***************************** -->
        <device Dname="LPC804M101JDH20">
          <compile header="Device/Include/LPC804.h"  define="LPC804M101JDH20"/>
          <debug svd="SVD/LPC804.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC80x_32.FLM"  start="0x00000000" size="0x00008000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

          <feature type="IOs"   n="17"/>
          <feature type="SOP"   n="20" name="TSSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC804M101JDH24'  ***************************** -->
        <device Dname="LPC804M101JDH24">
          <compile header="Device/Include/LPC804.h"  define="LPC804M101JDH24"/>
          <debug svd="SVD/LPC804.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC80x_32.FLM"  start="0x00000000" size="0x00008000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

          <feature type="IOs"   n="21"/>
          <feature type="SOP"   n="24" name="TSSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC804M111JDH24'  ***************************** -->
        <device Dname="LPC804M111JDH24">
          <compile header="Device/Include/LPC804.h"  define="LPC804M111JDH24"/>
          <debug svd="SVD/LPC804.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC80x_32.FLM"  start="0x00000000" size="0x00008000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

          <feature type="IOs"   n="20"/>
          <feature type="SOP"   n="24" name="TSSOP Package"/>
        </device>

        <!-- *************************  Device 'LPC804M101JHI33'  ***************************** -->
        <device Dname="LPC804M101JHI33">
          <compile header="Device/Include/LPC804.h"  define="LPC804M101JHI33"/>
          <debug svd="SVD/LPC804.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC80x_32.FLM"  start="0x00000000" size="0x00008000" RAMstart="0x10000000" RAMsize="0x07E0" default="1"/>

          <feature type="IOs"   n="30"/>
          <feature type="QFN"   n="33" name="HVQFN Package"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC8N04'  *************************** -->
      <subFamily DsubFamily="LPC8N04">
        <processor Dclock="8000000"/>

        <book name="Documents/UM11074.pdf" title="LPC8N04 User manual"/>
        <book name="Documents/LPC8N04.pdf" title="LPC8N04 Datasheet"/>
        <description>
The NXP LPC8N04 is an IC optimized for an entry level Cortex-M0+ MCU with built-in NFC interface.
LPC8N04 supports an effective system solution with a minimal number of external components for NFC related applications.
        </description>

        <feature type="TempSens"      n="1"/>
        <feature type="I2C"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="RTC"           n="32768"                       name="Internal RTC"/>
        <feature type="WDT"           n="1"                           name="Windowed Watchdog timer"/>
        <feature type="Timer"         n="2"                           name="32-Bit / 16-Bit Timer"/>
        <feature type="CoreOther"     n="1"                           name="NFC/RFID ISO 14443 type A interface"/>
        <feature type="CoreOther"     n="1"                           name="CRC engine"/>
        <feature type="CoreOther"     n="1"                           name="Unique device serial number"/>

        <!-- *************************  Device 'LPC8N04FHI24'  ***************************** -->
        <device Dname="LPC8N04FHI24">
          <compile header="Device/Include/LPC8N04.h" define="LPC8N04FHI24"/>
          <debug svd="SVD/LPC8N04.svd"/>
          <memory id="IROM1"                     start="0x00000000" size="0x00007800" startup="1" default="1"/>
          <memory id="IRAM1"                     start="0x10000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/LPC8N04_30.FLM" start="0x00000000" size="0x00007800"             default="1"/>

          <feature type="IOs"           n="12"/>
          <feature type="QFN"           n="24"                        name="QFN Package"/>
        </device>
      </subFamily>

