mdhardenburgh/Blinky/Packages/.cache/Keil.LPC800_DFP.1.10.1.pdsc
        <!-- *************************  Device 'LPC844M201JBD48'  ***************************** -->
        <device Dname="LPC844M201JBD48">
          <compile header="Device/Include/LPC844.h" define="LPC844M201JBD48"/>
          <debug svd="SVD/LPC844.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFP"           n="48"                        name="QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC844M201JBD64'  ***************************** -->
        <device Dname="LPC844M201JBD64">
          <compile header="Device/Include/LPC844.h" define="LPC844M201JBD64"/>
          <debug svd="SVD/LPC844.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"                        name="QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC844M201JHI33'  ***************************** -->
        <device Dname="LPC844M201JHI33">
          <compile header="Device/Include/LPC844.h" define="LPC844M201JHI33"/>
          <debug svd="SVD/LPC844.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"/>
          <feature type="IOs"           n="29"/>
          <feature type="QFN"           n="33"                        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC844M201JHI48'  ***************************** -->
        <device Dname="LPC844M201JHI48">
          <compile header="Device/Include/LPC844.h" define="LPC844M201JHI48"/>
          <debug svd="SVD/LPC844.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00002000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFN"           n="48"                        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC845M301JBD48'  ***************************** -->
        <device Dname="LPC845M301JBD48">
          <compile header="Device/Include/LPC845.h" define="LPC845M301JBD48"/>
          <debug svd="SVD/LPC845.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="4"/>
          <feature type="USART"         n="5"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="CoreOther"     n="1"                         name="Capacitive Touch Interface"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFP"           n="48"                        name="QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC845M301JBD64'  ***************************** -->
        <device Dname="LPC845M301JBD64">
          <compile header="Device/Include/LPC845.h" define="LPC845M301JBD64"/>
          <debug svd="SVD/LPC845.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="4"/>
          <feature type="USART"         n="5"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="CoreOther"     n="1"                         name="Capacitive Touch Interface"/>
          <feature type="IOs"           n="54"/>
          <feature type="QFP"           n="64"                        name="QFP Package"/>
        </device>

        <!-- *************************  Device 'LPC845M301JHI33'  ***************************** -->
        <device Dname="LPC845M301JHI33">
          <compile header="Device/Include/LPC845.h" define="LPC845M301JHI33"/>
          <debug svd="SVD/LPC845.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="4"/>
          <feature type="USART"         n="5"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="CoreOther"     n="1"                         name="Capacitive Touch Interface"/>
          <feature type="IOs"           n="29"/>
          <feature type="QFN"           n="33"                        name="QFN Package"/>
        </device>

        <!-- *************************  Device 'LPC845M301JHI48'  ***************************** -->
        <device Dname="LPC845M301JHI48">
          <compile header="Device/Include/LPC845.h" define="LPC845M301JHI48"/>
          <debug svd="SVD/LPC845.svd"/>
          <memory id="IROM1"                    start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                    start="0x10000000" size="0x00004000" default="1" init   ="0"/>
          <algorithm name="Flash/LPC84x_64.FLM" start="0x00000000" size="0x00010000" default="1"/>

          <feature type="I2C"           n="4"/>
          <feature type="USART"         n="5"/>
          <feature type="DAC"           n="2"       m="10"/>
          <feature type="CoreOther"     n="1"                         name="Capacitive Touch Interface"/>
          <feature type="IOs"           n="42"/>
          <feature type="QFN"           n="48"                        name="QFN Package"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="LPC802 CMSIS">
      <description>NXP LPC802 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC802*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="LPC804 CMSIS">
      <description>NXP LPC804 Devices and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="LPC804*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

