mdhardenburgh/Blinky/Packages/.cache/Keil.LPC800_DFP.1.10.1.pdsc
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC824 CMSIS">
      <description>Button driver for NXP LPCXpresso824-MAX Board</description>
        <files>
        <file category="sourceC" name="Boards/NXP/LPCXpresso824-MAX/Common/Buttons_LPCXpresso824-MAX.c"/>
        </files>
      </component>
    </bundle>

    <!-- LPCXpresso845-MAX Board Support -->
    <bundle Cbundle="LPCXpresso845-MAX" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso845-MAX Board</description>
      <doc></doc>
      <component Cgroup="LED"     Capiversion="1.0.0" condition="LPC845 CMSIS">
      <description>LED driver for NXP LPCXpresso845-MAX Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso845-MAX/Common/LED_LPCXpresso845-MAX.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC845 CMSIS">
      <description>Button driver for NXP LPCXpresso845-MAX Board</description>
        <files>
        <file category="sourceC" name="Boards/NXP/LPCXpresso845-MAX/Common/Buttons_LPCXpresso845-MAX.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board vendor="NXP" name="LPC812 LPCXpresso" revision="Rev. A" salesContact="http://www.nxp.com/support.html" orderForm="http://www.nxp.com/demoboard/OM13053.html#ordering">
      <description>NXP LPC812 LPCXpresso Board</description>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13053.html"  title="LPC812 LPCXpresso Board"/>
      <image public="1" large="https://www.nxp.com/assets/images/en/photography/OM13053_lpc812_Xpresso.png" small="https://www.nxp.com/assets/images/en/photography/OM13053_lpc812_Xpresso.png"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC812M101JDH20"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC81x"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="Poti"            n="1"              name="Potentiometer for ADC Input"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
    </board>

    <board vendor="NXP" name="LPCXpresso824-MAX" revision="Rev. 1" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPCXpresso824-MAX Board</description>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13071.html"  title="LPC824-MAX LPCXpresso Board"/>
      <image public="1" large="https://www.nxp.com/assets/images/en/photography/OM13071_PC824v2_LR_Main.jpg"
                        small="https://www.nxp.com/assets/images/en/photography/OM13071_PC824v2_LR_Main.jpg"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC824M201JHI33"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC824"/>
      <book category="setup" name="Documents/NXP824_Blinky_Lab.pdf" title="LPCXpresso824-MAX: Blinky Lab"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, User button"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board vendor="NXP" name="LPCXpresso845-MAX" revision="Rev. 2" salesContact="http://www.nxp.com/support.html">
      <description>NXP LPCXpresso845-MAX Board</description>
      <book category="overview"  name="http://www.nxp.com/demoboard/OM13097.html"  title="LPC845-MAX LPCXpresso Board"/>
      <image public="1" large="https://www.nxp.com/assets/images/en/dev-board-image/OM13097-LPCXpresso845-MAX-Board.jpg"
                        small="https://www.nxp.com/assets/images/en/dev-board-image/OM13097-LPCXpresso845-MAX-Board.jpg"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC845M301JBD64"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC845"/>
      <feature type="XTAL"            n="12000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="1"              name="I/O Port RGB LED"/>
      <feature type="Button"          n="3"              name="Reset, Wake, ISP"/>
      <feature type="ODbg"            n="1"              name="LPC-Link"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- LPC812 LPCXpresso Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/NXP/LPC812-LPCXpresso/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="LPC812 LPCXpresso" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
    <example name="Blinky" doc="Abstract.txt" folder="Boards/NXP/LPC812-LPCXpresso/Blinky">
      <description>Blinky example</description>
      <board name="LPC812 LPCXpresso" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- LPC824 LPCXpresso Board -->
    <example name="CMSIS-RTOS2 (Keil RTX5) Blinky" doc="Abstract.txt" folder="Boards/NXP/LPCXpresso824-MAX/RTOS2_KeilRTX5_Blinky">
      <description>CMSIS-RTOS2 (Keil RTX5) based Blinky example</description>
      <board name="LPCXpresso824-MAX" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- LPCXpresso845-MAX Board -->
    <example name="CMSIS-RTOS2 (Keil RTX5) Blinky" doc="Abstract.txt" folder="Boards/NXP/LPCXpresso845-MAX/RTOS2_KeilRTX5_Blinky">
      <description>CMSIS-RTOS2 (Keil RTX5) based Blinky example</description>
      <board name="LPCXpresso845-MAX" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
